user-4.0/tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgsBlockGgi2D/0.org/region_fluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    trackedSurface
    {
        type            slip;
//         type            calculated;
//         value           uniform 0;
    }
    movingWall
    {
        type            nutWallFunction;
//         type            nutUWallFunction;
//         type            nutkWallFunction;
//         type            nutkRoughWallFunction;
//         type            nutURoughWallFunction;
//         type            nutUSpaldingWallFunction;
        value           $internalField;
    }
    fixedWall
    {
        type            nutWallFunction;
//         type            nutUWallFunction;
//         type            nutkWallFunction;
//         type            nutkRoughWallFunction;
//         type            nutURoughWallFunction;
//         type            nutUSpaldingWallFunction;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
    "procBoundary.*"
    {
        type            processor;
        value           uniform 0;
    }
}

// ************************************************************************* //

